IDEA StatiCa Open Model
BeamDataEc2.IsYDirectionData Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 true for deflection data in Y direction
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public bool IsYDirectionData { get; set; }
Public Property IsYDirectionData As Boolean
	Get
	Set
public:
property bool IsYDirectionData {
	bool get ();
	void set (bool value);
}
Property Value
Type: Boolean
See Also
Reference
BeamDataEc2 Class
IdeaRS.OpenModel.Concrete Namespace